Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_branch_protection.this["kubo:bifrost-*"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjEwNDk3MDM="
      ~ push_restrictions               = [
          - "/aschmahmann",
          - "/gmasgras",
          - "/thattommyhall",
          + "ipfs/kubo-maintainers",
        ]
        # (10 unchanged attributes hidden)
    }

  # github_branch_protection.this["kubo:feat/stabilize-dht"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTUwNDUxNjk="
      ~ push_restrictions               = [
          - "/aschmahmann",
          - "/gmasgras",
          + "ipfs/kubo-maintainers",
        ]
        # (10 unchanged attributes hidden)
    }

  # github_branch_protection.this["kubo:master"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjI5MDgxMA=="
      ~ push_restrictions               = [
          + "ipfs/kubo-maintainers",
        ]
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_branch_protection.this["kubo:release"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNjU3MzY4"
      ~ push_restrictions               = [
          - "/Jorropo",
          - "/Stebalien",
          - "/aschmahmann",
          - "/hacdias",
          - "/whyrusleeping",
        ]
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_branch_protection.this["kubo:release-*"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTU2NzQyNTc="
      ~ push_restrictions               = [
          - "/Stebalien",
          - "/aschmahmann",
          - "/hsanjuan",
          - "/whyrusleeping",
        ]
        # (10 unchanged attributes hidden)
    }

  # github_repository_collaborator.this["helia-cli:achingbrain"] will be destroyed
  # (because key ["helia-cli:achingbrain"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "helia-cli:achingbrain" -> null
      - permission = "admin" -> null
      - repository = "helia-cli" -> null
      - username   = "achingbrain" -> null
    }

  # github_repository_collaborator.this["helia-delegated-routing-v1-http-api:achingbrain"] will be destroyed
  # (because key ["helia-delegated-routing-v1-http-api:achingbrain"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "helia-delegated-routing-v1-http-api:achingbrain" -> null
      - permission = "admin" -> null
      - repository = "helia-delegated-routing-v1-http-api" -> null
      - username   = "achingbrain" -> null
    }

  # github_repository_collaborator.this["helia-http-gateway:sgtpooki"] will be destroyed
  # (because key ["helia-http-gateway:sgtpooki"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "helia-http-gateway:SgtPooki" -> null
      - permission = "admin" -> null
      - repository = "helia-http-gateway" -> null
      - username   = "SgtPooki" -> null
    }

  # github_repository_collaborator.this["helia-http-gateway:whizzzkid"] will be destroyed
  # (because key ["helia-http-gateway:whizzzkid"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "helia-http-gateway:whizzzkid" -> null
      - permission = "admin" -> null
      - repository = "helia-http-gateway" -> null
      - username   = "whizzzkid" -> null
    }

  # github_repository_collaborator.this["helia-remote-pinning:sgtpooki"] will be destroyed
  # (because key ["helia-remote-pinning:sgtpooki"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "helia-remote-pinning:SgtPooki" -> null
      - permission = "admin" -> null
      - repository = "helia-remote-pinning" -> null
      - username   = "SgtPooki" -> null
    }

  # github_repository_collaborator.this["kubo:dennis-tra"] will be destroyed
  # (because key ["kubo:dennis-tra"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "kubo:dennis-tra" -> null
      - permission = "push" -> null
      - repository = "kubo" -> null
      - username   = "dennis-tra" -> null
    }

  # github_repository_collaborator.this["kubo:lidel"] will be destroyed
  # (because key ["kubo:lidel"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "kubo:lidel" -> null
      - permission = "admin" -> null
      - repository = "kubo" -> null
      - username   = "lidel" -> null
    }

  # github_repository_collaborator.this["service-worker-gateway:2color"] will be destroyed
  # (because key ["service-worker-gateway:2color"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "service-worker-gateway:2color" -> null
      - permission = "admin" -> null
      - repository = "service-worker-gateway" -> null
      - username   = "2color" -> null
    }

  # github_repository_collaborator.this["service-worker-gateway:aschmahmann"] will be destroyed
  # (because key ["service-worker-gateway:aschmahmann"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "service-worker-gateway:aschmahmann" -> null
      - permission = "admin" -> null
      - repository = "service-worker-gateway" -> null
      - username   = "aschmahmann" -> null
    }

  # github_repository_collaborator.this["service-worker-gateway:lidel"] will be destroyed
  # (because key ["service-worker-gateway:lidel"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "service-worker-gateway:lidel" -> null
      - permission = "admin" -> null
      - repository = "service-worker-gateway" -> null
      - username   = "lidel" -> null
    }

  # github_repository_collaborator.this["service-worker-gateway:marcopolo"] will be destroyed
  # (because key ["service-worker-gateway:marcopolo"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "service-worker-gateway:MarcoPolo" -> null
      - permission = "admin" -> null
      - repository = "service-worker-gateway" -> null
      - username   = "MarcoPolo" -> null
    }

  # github_repository_collaborator.this["service-worker-gateway:sgtpooki"] will be destroyed
  # (because key ["service-worker-gateway:sgtpooki"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "service-worker-gateway:SgtPooki" -> null
      - permission = "admin" -> null
      - repository = "service-worker-gateway" -> null
      - username   = "SgtPooki" -> null
    }

  # github_team.this["shipyard"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Members of Interplanetary Shipyard who work with or on IPFS"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "shipyard"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["helia-dev:whizzzkid"] will be destroyed
  # (because key ["helia-dev:whizzzkid"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"833f70f7615793aedd16ac6ad86e0f02e746fe8edb70052213d94dcf852cc2ef\"" -> null
      - id       = "7676419:whizzzkid" -> null
      - role     = "member" -> null
      - team_id  = "7676419" -> null
      - username = "whizzzkid" -> null
    }

  # github_team_membership.this["kubo maintainers:jorropo"] will be destroyed
  # (because key ["kubo maintainers:jorropo"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"9908d81e6f3b5ca2200c32d5a12ed764f8b72fe3831911d8c3cc9f7107aa062b\"" -> null
      - id       = "6744049:Jorropo" -> null
      - role     = "member" -> null
      - team_id  = "6744049" -> null
      - username = "Jorropo" -> null
    }

  # github_team_membership.this["shipyard:2color"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "2color"
    }

  # github_team_membership.this["shipyard:achingbrain"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "achingbrain"
    }

  # github_team_membership.this["shipyard:aschmahmann"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "aschmahmann"
    }

  # github_team_membership.this["shipyard:gammazero"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "gammazero"
    }

  # github_team_membership.this["shipyard:guillaumemichel"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "guillaumemichel"
    }

  # github_team_membership.this["shipyard:lidel"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "lidel"
    }

  # github_team_membership.this["shipyard:marcopolo"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "MarcoPolo"
    }

  # github_team_membership.this["shipyard:sgtpooki"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "SgtPooki"
    }

  # github_team_repository.this["admin:boxo"] will be destroyed
  # (because key ["admin:boxo"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"f9159e34c78f046e7097c41bb827c6005f6c939a882d7d9f5a765d8f7564783c\"" -> null
      - id         = "1516991:boxo" -> null
      - permission = "admin" -> null
      - repository = "boxo" -> null
      - team_id    = "1516991" -> null
    }

  # github_team_repository.this["admin:kubo"] will be destroyed
  # (because key ["admin:kubo"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"0d01568ef71a17293595a797aea06ad7b6d3dc28f41fbb36b52f836e8ef30fe9\"" -> null
      - id         = "1516991:kubo" -> null
      - permission = "admin" -> null
      - repository = "kubo" -> null
      - team_id    = "1516991" -> null
    }

  # github_team_repository.this["admin:rainbow"] will be destroyed
  # (because key ["admin:rainbow"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"de8d743ef09c621656818ae4683f89729af090b5ba5e2c5585f527d8d7d841a3\"" -> null
      - id         = "1516991:rainbow" -> null
      - permission = "admin" -> null
      - repository = "rainbow" -> null
      - team_id    = "1516991" -> null
    }

  # github_team_repository.this["admin:someguy"] will be destroyed
  # (because key ["admin:someguy"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"36b67a5d2099a9205801c0b99b0c769e2318e1807d26545160b992b2917e1fbb\"" -> null
      - id         = "1516991:someguy" -> null
      - permission = "admin" -> null
      - repository = "someguy" -> null
      - team_id    = "1516991" -> null
    }

  # github_team_repository.this["github-mgmt stewards:boxo"] will be destroyed
  # (because key ["github-mgmt stewards:boxo"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"ec39161ffa9995f9042b6046fd0084c98a21bf42b8ba4e7da6efffe145d6cc9b\"" -> null
      - id         = "6421993:boxo" -> null
      - permission = "pull" -> null
      - repository = "boxo" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:helia"] will be destroyed
  # (because key ["github-mgmt stewards:helia"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"991a7cd77112515f6b96babb32ccab804471ab11a292fbea3bcdfaa6b0ca5dc1\"" -> null
      - id         = "6421993:helia" -> null
      - permission = "pull" -> null
      - repository = "helia" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:helia-cli"] will be destroyed
  # (because key ["github-mgmt stewards:helia-cli"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"c43be74e09fc4b87a0bc3dfe749eeb03a0011649ee571348f6978fac17f333dc\"" -> null
      - id         = "6421993:helia-cli" -> null
      - permission = "pull" -> null
      - repository = "helia-cli" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:helia-delegated-routing-v1-http-api"] will be destroyed
  # (because key ["github-mgmt stewards:helia-delegated-routing-v1-http-api"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"2290ef043771539a0400c29eb6b69409dd0ae6b6fb195e38ef03eb442ce9d788\"" -> null
      - id         = "6421993:helia-delegated-routing-v1-http-api" -> null
      - permission = "pull" -> null
      - repository = "helia-delegated-routing-v1-http-api" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:helia-http-gateway"] will be destroyed
  # (because key ["github-mgmt stewards:helia-http-gateway"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"6e21eccfdc33bb282c7ca3821542fd3a6d67d991fc6e9e540b1eca6c0f65c67d\"" -> null
      - id         = "6421993:helia-http-gateway" -> null
      - permission = "pull" -> null
      - repository = "helia-http-gateway" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:helia-remote-pinning"] will be destroyed
  # (because key ["github-mgmt stewards:helia-remote-pinning"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"afb732d8135b965bf01615820a054c94f9ee1f5959b4b095f8c6252392f07fb5\"" -> null
      - id         = "6421993:helia-remote-pinning" -> null
      - permission = "pull" -> null
      - repository = "helia-remote-pinning" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:helia-verified-fetch"] will be destroyed
  # (because key ["github-mgmt stewards:helia-verified-fetch"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"c541e24366e7248ee222209d43da5c5644395e01e3d68297edadefa608030925\"" -> null
      - id         = "6421993:helia-verified-fetch" -> null
      - permission = "pull" -> null
      - repository = "helia-verified-fetch" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:kubo"] will be destroyed
  # (because key ["github-mgmt stewards:kubo"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"7cb926f93fac55508c1d862461daf2ffccab2d7d76581560983462eaf19a1302\"" -> null
      - id         = "6421993:kubo" -> null
      - permission = "pull" -> null
      - repository = "kubo" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:rainbow"] will be destroyed
  # (because key ["github-mgmt stewards:rainbow"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"233e25b576720556727bb6b99a3b436e8957cb7a7ed28d38c46db547cb149dc8\"" -> null
      - id         = "6421993:rainbow" -> null
      - permission = "pull" -> null
      - repository = "rainbow" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:service-worker-gateway"] will be destroyed
  # (because key ["github-mgmt stewards:service-worker-gateway"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"4520ecd1177c645c697a27cffd26e19de137f34849a7e53237486e6e33c5eb33\"" -> null
      - id         = "6421993:service-worker-gateway" -> null
      - permission = "pull" -> null
      - repository = "service-worker-gateway" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["github-mgmt stewards:someguy"] will be destroyed
  # (because key ["github-mgmt stewards:someguy"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"f9a7dc11a31dfef65cd8217f650c6cdcad0c359af863a3932457b4820073307a\"" -> null
      - id         = "6421993:someguy" -> null
      - permission = "pull" -> null
      - repository = "someguy" -> null
      - team_id    = "6421993" -> null
    }

  # github_team_repository.this["helia-dev:service-worker-gateway"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "7676419:service-worker-gateway"
      ~ permission = "pull" -> "admin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["ipdx:kubo"] will be destroyed
  # (because key ["ipdx:kubo"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"0d01568ef71a17293595a797aea06ad7b6d3dc28f41fbb36b52f836e8ef30fe9\"" -> null
      - id         = "6349983:kubo" -> null
      - permission = "admin" -> null
      - repository = "kubo" -> null
      - team_id    = "6349983" -> null
    }

  # github_team_repository.this["maintainers:kubo"] will be destroyed
  # (because key ["maintainers:kubo"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"10a79a1e7489ed295ef9176c671523edf7bb97f40815dfd95bbbddeefc839b9b\"" -> null
      - id         = "3729031:kubo" -> null
      - permission = "push" -> null
      - repository = "kubo" -> null
      - team_id    = "3729031" -> null
    }

  # github_team_repository.this["merge - go:boxo"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "3364102:boxo"
      ~ permission = "maintain" -> "push"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["repos - go:boxo"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "3232508:boxo"
      ~ permission = "maintain" -> "push"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["shipyard:boxo"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "boxo"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:helia"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "helia"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:helia-cli"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "helia-cli"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:helia-delegated-routing-v1-http-api"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "helia-delegated-routing-v1-http-api"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:helia-http-gateway"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "helia-http-gateway"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:helia-remote-pinning"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "helia-remote-pinning"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:helia-verified-fetch"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "helia-verified-fetch"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:kubo"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "kubo"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:rainbow"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "rainbow"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:service-worker-gateway"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "service-worker-gateway"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["shipyard:someguy"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "someguy"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["w3dt-stewards:boxo"] will be destroyed
  # (because key ["w3dt-stewards:boxo"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"f9159e34c78f046e7097c41bb827c6005f6c939a882d7d9f5a765d8f7564783c\"" -> null
      - id         = "4656983:boxo" -> null
      - permission = "admin" -> null
      - repository = "boxo" -> null
      - team_id    = "4656983" -> null
    }

  # github_team_repository.this["w3dt-stewards:helia"] will be destroyed
  # (because key ["w3dt-stewards:helia"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"9df536ef2d5118bacb930792a8ac0a79d3dde48a9b95f18883a43b342f1acddc\"" -> null
      - id         = "4656983:helia" -> null
      - permission = "admin" -> null
      - repository = "helia" -> null
      - team_id    = "4656983" -> null
    }

  # github_team_repository.this["w3dt-stewards:helia-delegated-routing-v1-http-api"] will be destroyed
  # (because key ["w3dt-stewards:helia-delegated-routing-v1-http-api"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"0748a0b839f1c723a225527828e7b80322c294e0b675088835d2d275882385b6\"" -> null
      - id         = "4656983:helia-delegated-routing-v1-http-api" -> null
      - permission = "admin" -> null
      - repository = "helia-delegated-routing-v1-http-api" -> null
      - team_id    = "4656983" -> null
    }

  # github_team_repository.this["w3dt-stewards:helia-verified-fetch"] will be destroyed
  # (because key ["w3dt-stewards:helia-verified-fetch"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"54a3d6af61cfa87bb52a4a2b673d888b5bd0cb1e9d11fa3d741dea9501de90ee\"" -> null
      - id         = "4656983:helia-verified-fetch" -> null
      - permission = "admin" -> null
      - repository = "helia-verified-fetch" -> null
      - team_id    = "4656983" -> null
    }

  # github_team_repository.this["w3dt-stewards:kubo"] will be destroyed
  # (because key ["w3dt-stewards:kubo"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"0d01568ef71a17293595a797aea06ad7b6d3dc28f41fbb36b52f836e8ef30fe9\"" -> null
      - id         = "4656983:kubo" -> null
      - permission = "admin" -> null
      - repository = "kubo" -> null
      - team_id    = "4656983" -> null
    }

  # github_team_repository.this["w3dt-stewards:rainbow"] will be destroyed
  # (because key ["w3dt-stewards:rainbow"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"de8d743ef09c621656818ae4683f89729af090b5ba5e2c5585f527d8d7d841a3\"" -> null
      - id         = "4656983:rainbow" -> null
      - permission = "admin" -> null
      - repository = "rainbow" -> null
      - team_id    = "4656983" -> null
    }

  # github_team_repository.this["w3dt-stewards:someguy"] will be destroyed
  # (because key ["w3dt-stewards:someguy"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"36b67a5d2099a9205801c0b99b0c769e2318e1807d26545160b992b2917e1fbb\"" -> null
      - id         = "4656983:someguy" -> null
      - permission = "admin" -> null
      - repository = "someguy" -> null
      - team_id    = "4656983" -> null
    }

Plan: 20 to add, 8 to change, 38 to destroy.
```

</details>
<!-- Sticky Pull Request Commentplan -->